eziya/STM32_SECURITY_LAB/MOOC_DOCS/Part6/STM32CubeExpansion_SBSFU_V2.6.1/Projects/B-L4S5I-IOT01A/Applications/2_Images_KMS/2_Images_SBSFU/SBSFU/Target/sfu_low_level_security.c
  MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
  MPU_InitStruct.Number               = MPU_REGION_NUMBER6;
  MPU_InitStruct.BaseAddress          = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_START;
  MPU_InitStruct.Size                 = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_SIZE;
  MPU_InitStruct.SubRegionDisable     = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_SREG;
  MPU_InitStruct.AccessPermission     = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_PERM;
  MPU_InitStruct.DisableExec          = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_EXEC;
  MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable         = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable          = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.TypeExtField         = MPU_TEX_LEVEL0;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);



  return SFU_SUCCESS;
}
#endif /* SFU_MPU_PROTECT_ENABLE */

#if  (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
/**
  * @brief  Apply MPU protection before executing Standalone loader
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionMPU_StandaloneLoader(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
  MPU_InitStruct.Number               = MPU_REGION_NUMBER6;
  MPU_InitStruct.BaseAddress          = LOADER_PROTECT_MPU_AREA_START;
  MPU_InitStruct.Size                 = LOADER_PROTECT_MPU_AREA_SIZE;
  MPU_InitStruct.SubRegionDisable     = LOADER_PROTECT_MPU_AREA_SREG;
  MPU_InitStruct.AccessPermission     = LOADER_PROTECT_MPU_AREA_PERM;
  MPU_InitStruct.DisableExec          = LOADER_PROTECT_MPU_AREA_EXEC;
  MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable         = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable          = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.TypeExtField         = MPU_TEX_LEVEL0;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  return SFU_SUCCESS;
}
#endif /* (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */

#ifdef SFU_MPU_PROTECT_ENABLE
/**
  * @brief  Apply MPU protection
  * @param  uStep Configuration step : SFU_INITIAL_CONFIGURATION, SFU_SECOND_CONFIGURATION, SFU_THIRD_CONFIGURATION
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionMPU(uint8_t uStep)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /**
    * ===== MPU regions =====
    * The executable code is made of: {SB_SFU vectors, SE_CoreBin, SB_SFU}
    * This executable code is mapped with 2 MPU regions:
    *   - Region 1: size up to 256kB with up to 8*32kB sub-regions
    *   - Region 2: size up to 32kB  with up to 8*4kB sub-regions
    * Region 2 is placed right after Region 1, even if Region 1 is smaller than 128kB.
    *
    *
    * IMPORTANT: the maximum executable size is NOT 256kB + 32kB.
    *            The algorithm accepts a size up to 256kB + 32kB - 1 byte.
    *
    * Examples:
    *
    * 1. Region 1 is 256kB long with Region 2 being 8kB long
    * <--------------256kB---------------><-------32kB--------->
    * [Reg.1.1][Reg.1.2].........[Reg.1.8][Reg.2.1][Reg.2.2].FF.   (.FF. means deactivated)
    *
    * 2. Region 1 is 128kB long with Region 2 being 12kB long
    * <---------------256kB---------------><------------32kB------------->
    * [Reg.1.1][Reg.1.2].........[Reg.1.4][Reg.2.1][Reg.2.2][Reg.2.3].FF.   (.FF. means deactivated)
    *
    * The size covered by region 1 corresponds to the quotient of the sbsfu code size divided by 32kB.
    * The size covered by region 2 corresponds to the remainder of the sbsfu code size divided by 32kB, rounded-up to
    * the next 4kB.
    */
  uint32_t region1_first_32kb_sub_region_disabled; /* index of the first sub-region to be disabled in region 1 */
  uint32_t region2_first_4kb_sub_region_disabled;  /* index of the first sub-region to be disabled in region 2 */
  /* The total size of the executable code is: SFU_ROM_ADDR_END - FLASH_BASE + 1 */
  uint32_t sbsfu_code_size = (SFU_ROM_ADDR_END - FLASH_BASE + 1U);  /* sbsfu, secure engine, callgate, se_interface,
                                                                      PCROPed keys... */
  uint8_t mpu_region_num; /* id of the MPU region being configured */

  /* Check/Apply MPU **********************************************************/
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* Compute the number of 16Kbytes sub-regions required to cover the executable size in Region 1 (up to 8 maximum).
    * This number of sub-regions is the left-SHIFT value we apply to decide which regions are disabled.
    * The total size of the executable code is: SFU_ROM_ADDR_END - FLASH_BASE + 1 (sbsfu, secure engine, callgate,
    * se_interface, PCROPed keys...)
    *
    * WATCH OUT: This value cannot exceed SFU_PROTECT_MPU_MAX_NB_SUBREG (8 sub-regions).
    */
  region1_first_32kb_sub_region_disabled = sbsfu_code_size >> 15U ; /* shifting by 15 to divide by 32k */

  /* Compute the remainder of the code size divided by 16k */
  region2_first_4kb_sub_region_disabled = sbsfu_code_size & 32767U;

  /* Compute the number of 4Kbytes sub-regions required to cover the end of the executable in Region 2 (up to 8 maximum)
    * This number of sub-regions is the left-SHIFT value we apply to decide which regions are disabled.
    */
  if (region2_first_4kb_sub_region_disabled != 0U)
  {
    /*
      * The code size is not a multiple of 16k.
      * We compute the number of 4kB sub-regions needed in Region 2.
      *
      * +4095 to round-up to next 4k and shifting by 12 to divide by 4k
      */
    region2_first_4kb_sub_region_disabled = ((region2_first_4kb_sub_region_disabled + 4095U) >> 12U);
  }
  else
  {
    /*
      * No remainder: the code size is a multiple of 32k.
      * 2 possibilities but only 1 is supported:
      *  - All 4kB sub-regions are needed in Region 2 if the executable size is 256kB + 32kB.
      *    In this case, region1_first_32kb_sub_region_disabled reaches 9 so exceeds 8 and we return an error.
      *    NOT SUPPORTED
      *
      *  - Or no 4Kb sub-region is needed in Region 2 because the executable is contained fully in Region 1.
      *    SUPPORTED
      */
    region2_first_4kb_sub_region_disabled = 0U; /* Will result in 0xFF << 0 : disable all sub-regions */
  }
  /*
    * If the executable size is more than 256kB + 32kB - 1 byte then we return an error,
    * because the algorithm would try configuring 9 sub-regions of 32kB.
    * Restriction: the current algorithm cannot compute that we need 8*32kB + 8*4kB.
    */
  if (region1_first_32kb_sub_region_disabled <= SFU_PROTECT_MPU_MAX_NB_SUBREG)
  {
    e_ret_status = SFU_SUCCESS;

#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n\t  [MPU] Region 1 with %d sub-region(s).", region1_first_32kb_sub_region_disabled);
    TRACE("\r\n\t  [MPU] Region 2 with %d sub-region(s).", region2_first_4kb_sub_region_disabled);
#endif /* SFU_VERBOSE_DEBUG_MODE */

    /* Sanity check: let's make sure the MPU settings cover the executable code */
    if (((region1_first_32kb_sub_region_disabled * 32768U) + (region2_first_4kb_sub_region_disabled * 4096U)) <
        sbsfu_code_size)
    {
      /* The MPU settings do not cover properly the executable code size */
      TRACE("\r\n [MPU] Executable code (%lu bytes) not fully covered !", sbsfu_code_size);
      return SFU_ERROR;
    }
    /* else the MPU settings cover at least the executable code size */

#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n= [SBOOT] MPU REGIONS CONFIGURATION");
#endif /* SFU_VERBOSE_DEBUG_MODE */
    /* The UserApp needs to know this configuration in case it wants to use the same WRP Areas */
    /* Initializes and configures the Region and the memory to be protected */
    for (mpu_region_num = 0U; mpu_region_num < (sizeof(MpuAreas) / sizeof(SFU_MPU_InitTypeDef)); mpu_region_num++)
    {
      MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
      MPU_InitStruct.Number               = MpuAreas[mpu_region_num].Number;
      MPU_InitStruct.BaseAddress          = MpuAreas[mpu_region_num].BaseAddress;
      MPU_InitStruct.Size                 = MpuAreas[mpu_region_num].Size;
      MPU_InitStruct.SubRegionDisable     = MpuAreas[mpu_region_num].SubRegionDisable;
      MPU_InitStruct.TypeExtField         = MPU_TEX_LEVEL0;
      MPU_InitStruct.AccessPermission     = MpuAreas[mpu_region_num].AccessPermission;
      MPU_InitStruct.DisableExec          = MpuAreas[mpu_region_num].DisableExec;
      MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
      MPU_InitStruct.IsCacheable          = MPU_ACCESS_CACHEABLE;
      MPU_InitStruct.IsBufferable         = MPU_ACCESS_NOT_BUFFERABLE;

#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n\t  Region %d", mpu_region_num);
#endif /* SFU_VERBOSE_DEBUG_MODE */

