eziya/STM32_SECURITY_LAB/MOOC_DOCS/Part6/STM32CubeExpansion_SBSFU_V2.6.1/Projects/B-L4S5I-IOT01A/Applications/2_Images_KMS/2_Images_SBSFU/SBSFU/Target/sfu_low_level_security.c
      if (mpu_region_num == 1U)
      {
        /* Region 1 (executable, up to 256kB with up to 8*32kB sub-regions) */
        MPU_InitStruct.SubRegionDisable = (uint8_t)(0xffU << region1_first_32kb_sub_region_disabled);
      }
      else if (mpu_region_num == 2U)
      {
        /* Region 2 (executable, up to 32kB with up to 8*4kB sub-regions) */
        MPU_InitStruct.SubRegionDisable = (uint8_t)(0xffU << region2_first_4kb_sub_region_disabled);
        /* The region start address is the 16k-aligned address before the end address of the executable area */
        MPU_InitStruct.BaseAddress = (SFU_ROM_ADDR_END  & ~32767U); /* 32k LSBs set to 0 */
      }
      else
      {
        /*  keep the settings from the constant */
      }

#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE(" @:%x size:%x sub:%x perm:%x exec:%x",
            MPU_InitStruct.BaseAddress, MPU_InitStruct.Size, MPU_InitStruct.SubRegionDisable,
            MPU_InitStruct.AccessPermission, MPU_InitStruct.DisableExec);
#endif /* SFU_VERBOSE_DEBUG_MODE */

      if (uStep == SFU_INITIAL_CONFIGURATION)
      {
        HAL_MPU_ConfigRegion(&MPU_InitStruct);
      }
      else
      {
        if (MPU_CheckConfig(&MPU_InitStruct) == SFU_ERROR)
        {
          return SFU_ERROR;
        }
      }
    }

    if (uStep == SFU_INITIAL_CONFIGURATION)
    {
#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n");
#endif /* SFU_VERBOSE_DEBUG_MODE */
      /* Enables the MPU */
      HAL_MPU_Enable(MPU_HARDFAULT_NMI);

#if defined(SCB_SHCSR_MEMFAULTENA_Msk)
      /* Enables memory fault exception */
      SCB->SHCSR |= SCB_SHCSR_MEMFAULTENA_Msk;
#endif /* SCB_SHCSR_MEMFAULTENA_Msk */
    }
    else
    {
      if (MPU->CTRL != (MPU_HARDFAULT_NMI | MPU_CTRL_ENABLE_Msk))
      {
        return SFU_ERROR;
      }
#if defined(SCB_SHCSR_MEMFAULTENA_Msk)
      if ((SCB->SHCSR & SCB_SHCSR_MEMFAULTENA_Msk) != SCB_SHCSR_MEMFAULTENA_Msk)
      {
        return SFU_ERROR;
      }
#endif /* SCB_SHCSR_MEMFAULTENA_Msk */
    }
  } /* Else: too many sub-regions in Region 1, return SFU_ERROR */
#if defined(SFU_VERBOSE_DEBUG_MODE)
  else
  {
    TRACE("\r\n\t  [MPU] Too many MPU sub-regions in Region 1 : %d > %d", region1_first_32kb_sub_region_disabled,
          SFU_PROTECT_MPU_MAX_NB_SUBREG);
  }
#endif /* SFU_VERBOSE_DEBUG_MODE */

  if (e_ret_status == SFU_SUCCESS)
  {
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_MPU, FLOW_CTRL_MPU);
  }
  return e_ret_status;
}

#endif /*SFU_MPU_PROTECT_ENABLE*/


#ifdef SFU_FWALL_PROTECT_ENABLE
/**
  * @brief  Check if FWALL protection is enabled.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_CheckProtectionFWALL(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  if (__HAL_FIREWALL_IS_ENABLED() != RESET)
  {
    /* Firewall enabled: from this point, the Firewall is closed */
    e_ret_status = SFU_SUCCESS;
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_FWALL, FLOW_CTRL_FWALL);
  }
  return e_ret_status;
}

/**
  * @brief  Apply FWALL protection: CODE, NVDATA and VDATA.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionFWALL(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  FIREWALL_InitTypeDef FWALL_InitStruct;
  FIREWALL_InitTypeDef FWALL_VerifStruct;

  /* Protected code segment start address and length (it has to be multiple of 256 bytes). */
  FWALL_InitStruct.CodeSegmentStartAddress      = SFU_PROTECT_FWALL_CODE_ADDR_START;
  FWALL_InitStruct.CodeSegmentLength            = SFU_PROTECT_FWALL_CODE_SIZE;

  /* Protected Non volatile data segment (in Flash memory) start address and length */
  FWALL_InitStruct.NonVDataSegmentStartAddress    = SFU_PROTECT_FWALL_NVDATA_ADDR_START;
  FWALL_InitStruct.NonVDataSegmentLength          = SFU_PROTECT_FWALL_NVDATA_SIZE;

  /* Protected volatile data segment (in SRAM1 memory) start address and length */
  FWALL_InitStruct.VDataSegmentStartAddress    = SFU_PROTECT_FWALL_VDATA_ADDR_START;
  FWALL_InitStruct.VDataSegmentLength          = SFU_PROTECT_FWALL_VDATA_SIZE;

  /* The protected volatile data segment can't be executed */
  FWALL_InitStruct.VolatileDataExecution       = FIREWALL_VOLATILEDATA_NOT_EXECUTABLE;

  /* The protected volatile data segment is shared with non-protected
  application code */
  FWALL_InitStruct.VolatileDataShared          = FIREWALL_VOLATILEDATA_NOT_SHARED;

  /* Firewall configuration */
  if (HAL_FIREWALL_Config(&FWALL_InitStruct) == HAL_OK)
  {
    /* Verify firewall configuration */
    HAL_FIREWALL_GetConfig(&FWALL_VerifStruct);
    if ((FWALL_VerifStruct.CodeSegmentStartAddress == (SFU_PROTECT_FWALL_CODE_ADDR_START & FW_CSSA_ADD)) &&
        (FWALL_VerifStruct.CodeSegmentLength == (SFU_PROTECT_FWALL_CODE_SIZE & FW_CSL_LENG)) &&
        (FWALL_VerifStruct.NonVDataSegmentStartAddress == (SFU_PROTECT_FWALL_NVDATA_ADDR_START & FW_NVDSSA_ADD)) &&
        (FWALL_VerifStruct.NonVDataSegmentLength == (SFU_PROTECT_FWALL_NVDATA_SIZE & FW_NVDSL_LENG)) &&
        (FWALL_VerifStruct.VDataSegmentStartAddress == (SFU_PROTECT_FWALL_VDATA_ADDR_START & FW_VDSSA_ADD)) &&
        (FWALL_VerifStruct.VDataSegmentLength == (SFU_PROTECT_FWALL_VDATA_SIZE & FW_VDSL_LENG)) &&
        (FWALL_VerifStruct.VolatileDataExecution == (FIREWALL_VOLATILEDATA_NOT_EXECUTABLE & FW_CR_VDE)) &&
        (FWALL_VerifStruct.VolatileDataShared == (FIREWALL_VOLATILEDATA_NOT_SHARED & FW_CR_VDS)))
    {
      /* Enable Firewall */
      HAL_FIREWALL_EnableFirewall();
      /* Check the outcome of the enable procedure */
      if (__HAL_FIREWALL_IS_ENABLED() != RESET)
      {
        /* Firewall enabled: from this point, the Firewall is closed */
        e_ret_status = SFU_SUCCESS;
        /* Execution stopped if flow control failed */
        FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_FWALL, FLOW_CTRL_FWALL);
      }
    }
  }
  return e_ret_status;
}
#endif /* SFU_FWALL_PROTECT_ENABLE */

#ifdef SFU_DMA_PROTECT_ENABLE
/**
  * @brief  Apply DMA protection
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionDMA(void)
{
  /*
   * In this function we disable the DMA buses in order to avoid that while the SB/SFU is running
   * some DMA has been already enabled (e.g. through debugger in RDP-1 after reset) in order to access sensitive
   * information in SRAM, FLASH
   */
  /* Disable  DMA1, DMA2 */
  __HAL_RCC_DMA1_CLK_DISABLE();

  __HAL_RCC_DMA2_CLK_DISABLE();





